---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricWireItem.WireType
source: html/bf83d6ed-a392-4908-45ed-e955860d15a2.htm
---
# Autodesk.Revit.DB.Structure.FabricWireItem.WireType Property

The wire type of this wire item

## Syntax (C#)
```csharp
public ElementId WireType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: wireType is not a valid Element identifier.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null